Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketchPath3d Property
 Sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketchPath3d { get; }
Public Shared ReadOnly Property InvalidSketchPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketchPath3d {
	FailureDefinitionId^ get ();
}
static member InvalidSketchPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace